{
    "Books":[
       {
          "id":0,
          "name":"Half of a Yellow Sun",
          "imgURL":"",
          "description":"The novel tells the story of the Biafran War through the perspective of the characters Olanna, Ugwu, and Richard. It received critical acclaim and won the Women's Prize for Fiction in 2007. In 2013, it was adapted into a film of the same name. She places a human face on a war that has been far removed from historical memory outside of Nigeria. Adichie drew on first-hand eyewitness accounts from her parents and close family, friends and compatriots who were involved in the Biafran conflict. She researched books on the war for years (even though they could be “boring”) and says that almost every single incident in the novel is based on something real "
       },
       {
          "id":1,
          "name":"Americanah",
          "imgURL":"",
          "description":"Americanah tells the story of a young Nigerian woman, Ifemelu, who immigrated to the United States to attend university. The novel traces Ifemelu's life in both countries, threaded by her love story with high school classmate Obinze. It was Adichie's third novel, published on May 14, 2013 by Alfred A. Knopf .  Her novel Americanah explores this question of what it means to be black in the U.S., and tells the story of a young Nigerian couple, one of whom leaves for England and the other of whom leaves for America."
       },
       {
          "id":2,
          "name":"Purple hibiscus",
          "imgURL":"",
          "description":" Purple Hibiscus tells the story of a young Nigerian girl, Kambili, and her family. Throughout the novel, the author wrestles with themes of identity, freedom, oppression, love, and tradition as she explores the tensions within Kambili's family and within the country of Nigeria itself. Purple Hibiscus is set in postcolonial Nigeria,a country beset by political instability and economic difficulties. The central character is Kambili Achike, aged fifteen for much of the period covered by the book, a member of a wealthy family in Enugu State, dominated by her devoutly Catholic father, Eugene."
       },
       {
          "id":3,
          "name":"The thing around your neck",
          "imgURL":"",
          "description":"The main theme of the story “The Thing Around Your Neck” by Chimamanda Ngozi Adichie is cultural differences, leading to culture shock when the main character comes into contact with a culture completely different from her own. In “A Private Experience,” a medical student hides from a violent riot with a poor Muslim woman whose dignity and faith force her to confront the realities and fears she's been pushing away. In “Tomorrow is Too Far,” a woman unlocks the devastating secret that surrounds her brother's death"
       },
       {
          "id":4,
          "name":"We should all be feminist ",
          "imgURL":"",
          "description":"The Stereotypical Idea Of Feminism And The Word Feminist One has to understand that feminism is about the social, economic and political equality of the sexes. It demands an annihilation of the gender hierarchy and not women's rule over men as is often misinterpreted. She expounds beautifully on the same .We Should All Be Feminists is a book by Chimamanda Adichie in which Adichie argues that being a feminist means understanding and acknowledging that sexism exists. Adichie recalls a male friend in her home country of Nigeria calling her 'a feminist', clearly meaning it as an insult"
       }
    ]
 }